1. Grouping and Aggregation (20 Marks)

In [2]:
import pandas as pd

In [9]:
data = {
    'Employee': ['Alice', 'Bob', 'Alice', 'Bob', 'Charlie', 'Alice', 'Charlie', 'Bob'],
    'Region': ['North', 'South', 'North', 'South', 'North', 'South', 'North', 'North'],
    'Sales': [200, 150, 300, 400, 100, 250, 300, 350],
    'Year': [2023, 2023, 2024, 2024, 2023, 2024, 2024, 2023]
}

df = pd.DataFrame(data)

Group the data by Employee and calculate the total sales for each employee. (5 Marks)

In [60]:
total_sales=df.groupby('Employee')['Sales'].sum()
total_sales

Employee
Alice      750
Bob        900
Charlie    400
Name: Sales, dtype: int64

Group the data by Region and find the average sales per region. (5 Marks)

In [22]:
df.groupby('Region')['Sales'].mean()

Region
North    250.000000
South    266.666667
Name: Sales, dtype: float64

Group the data by both Employee and Year to calculate the total sales for each combination. (10 Marks)

In [29]:
df.groupby(['Employee','Year'])['Sales'].sum()
#df.groupby('Year')['Sales'].sum()

Employee  Year
Alice     2023    200
          2024    550
Bob       2023    500
          2024    400
Charlie   2023    100
          2024    300
Name: Sales, dtype: int64

2. Merging and Concatenation (20 Marks)

In [35]:
employee_details = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'Department': ['Sales', 'Sales', 'Marketing', 'HR']
})

sales_targets = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
    'Sales_Target': [1000, 1200, 800, 500]
})

Merge the two datasets on the Employee column to combine all details.

In [56]:
merged_data=pd.merge(employee_details,sales_targets,on = 'Employee')
merged_data

  Employee  Age Department  Sales_Target
0    Alice   25      Sales          1000
1      Bob   30      Sales          1200
2  Charlie   35  Marketing           800
3    David   40         HR           500

Create a new column showing the difference between Sales_Target and total sales (calculated from Task 1). Hint: Use the merged dataset for calculations. (10 Marks)

In [94]:
merged_data=pd.merge(sales_targets,total_sales,on='Employee')
merged_data['Difference']=merged_data['Sales_Target']-merged_data['Sales']
merged_data

  Employee  Sales_Target  Sales  Difference
0    Alice          1000    750         250
1      Bob          1200    900         300
2  Charlie           800    400         400

3. Working with Time-Series Data (20 Marks)

In [85]:
stock_prices = pd.DataFrame({
    'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05'],
    'Price': [100, 102, 105, 107, 110]
})
stock_prices

         Date  Price
0  2024-01-01    100
1  2024-01-02    102
2  2024-01-03    105
3  2024-01-04    107
4  2024-01-05    110

Convert the Date column to a datetime object. (5 Marks)

In [100]:
stock_prices['Date']=pd.to_datetime(stock_prices['Date'])
stock_prices

        Date  Price
0 2024-01-01    100
1 2024-01-02    102
2 2024-01-03    105
3 2024-01-04    107
4 2024-01-05    110

Resample the data to calculate the weekly average price. (10 Marks)

Find the day with the highest stock price. (5 Marks)

In [120]:
 stock_prices.loc[stock_prices['Price'].idxmax()]

Price    110
Name: 2024-01-05 00:00:00, dtype: int64

4. Pivot Tables and Cross-Tabulations (20 Marks)

In [123]:
import pandas as pd

data = {
    'Employee': ['Alice', 'Bob', 'Alice', 'Bob', 'Charlie', 'Alice', 'Charlie', 'Bob'],
    'Region': ['North', 'South', 'North', 'South', 'North', 'South', 'North', 'North'],
    'Sales': [200, 150, 300, 400, 100, 250, 300, 350],
    'Year': [2023, 2023, 2024, 2024, 2023, 2024, 2024, 2023]
}

df = pd.DataFrame(data)

Create a pivot table to find the total sales by Region and Year. (10 Marks)

In [148]:
 sales_pivot=pd.pivot_table(df, values='Sales', index='Region', columns='Year', aggfunc='sum', fill_value=0)
sales_pivot

Year    2023  2024
Region
North    650   600
South    150   650

Create a cross-tabulation showing the count of employees working in each Region for each Year. (10 Marks)

In [137]:
pd.crosstab(index=df['Region'],columns=df['Year'])

Year    2023  2024
Region
North      3     2
South      1     2

5. Exporting Data (10 Marks)

Save the final merged dataset (from Task 2) to a CSV file named employee_sales.csv. (5 Marks)

In [144]:
merged_data.to_csv('employee_sales.csv')

Save the pivot table (from Task 4) to an Excel file named sales_summary.xlsx. (5 Marks)

In [150]:
sales_pivot.to_excel('sales_summary.xlsx')